MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMR21E16A/mcu.h
#define LOCKBIT_SIZE                   _UINT32_(0x00000004)    /*    0kB Memory segment type: fuses */
#define OTP1_SIZE                      _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP2_SIZE                      _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP4_SIZE                      _UINT32_(0x000000e0)    /*    0kB Memory segment type: fuses */
#define OTP4_PAGE_SIZE                 _UINT32_(        64)
#define OTP4_NB_OF_PAGES               _UINT32_(         3)

#define TEMP_LOG_SIZE                  _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define USER_PAGE_SIZE                 _UINT32_(0x00000100)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UINT32_(        64)
#define USER_PAGE_NB_OF_PAGES          _UINT32_(         4)

#define AUX0_SIZE                      _UINT32_(0x00000100)    /*    0kB Memory segment type: user_page */
#define AUX0_PAGE_SIZE                 _UINT32_(        64)
#define AUX0_NB_OF_PAGES               _UINT32_(         4)

#define AUX1_SIZE                      _UINT32_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX1_PAGE_SIZE                 _UINT32_(        64)
#define AUX1_NB_OF_PAGES               _UINT32_(         4)

#define HMCRAMC0_SIZE                  _UINT32_(0x00004000)    /*   16kB Memory segment type: ram */
#define HPB0_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB1_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB2_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */
#define SCS_SIZE                       _UINT32_(0x00001000)    /*    4kB Memory segment type: io */
#define PERIPHERALS_SIZE               _UINT32_(0x20000000)    /* 524288kB Memory segment type: io */

#define FLASH_ADDR                     _UINT32_(0x00000000)    /* FLASH base address (type: flash)*/
#define CAL_ADDR                       _UINT32_(0x00800000)    /* CAL base address (type: fuses)*/
#define AUX3_ADDR                      _UINT32_(0x0080a000)    /* AUX3 base address (type: fuses)*/
#define LOCKBIT_ADDR                   _UINT32_(0x00802000)    /* LOCKBIT base address (type: fuses)*/
#define OTP1_ADDR                      _UINT32_(0x00806000)    /* OTP1 base address (type: fuses)*/
#define OTP2_ADDR                      _UINT32_(0x00806008)    /* OTP2 base address (type: fuses)*/
#define OTP4_ADDR                      _UINT32_(0x00806020)    /* OTP4 base address (type: fuses)*/
#define TEMP_LOG_ADDR                  _UINT32_(0x00806030)    /* TEMP_LOG base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UINT32_(0x00804000)    /* USER_PAGE base address (type: user_page)*/
#define AUX0_ADDR                      _UINT32_(0x00804000)    /* AUX0 base address (type: user_page)*/
#define AUX1_ADDR                      _UINT32_(0x00806000)    /* AUX1 base address (type: fuses)*/
#define HMCRAMC0_ADDR                  _UINT32_(0x20000000)    /* HMCRAMC0 base address (type: ram)*/
#define HPB0_ADDR                      _UINT32_(0x40000000)    /* HPB0 base address (type: io)*/
#define HPB1_ADDR                      _UINT32_(0x41000000)    /* HPB1 base address (type: io)*/
#define HPB2_ADDR                      _UINT32_(0x42000000)    /* HPB2 base address (type: io)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/
#define SCS_ADDR                       _UINT32_(0xe000e000)    /* SCS base address (type: io)*/
#define PERIPHERALS_ADDR               _UINT32_(0x40000000)    /* PERIPHERALS base address (type: io)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR SAMR21E16A                                         */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UINT32_(0X1001031E)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR SAMR21E16A                                    */
/* ************************************************************************** */

/* ************************************************************************** */
/* Event Generator IDs for SAMR21E16A */
/* ************************************************************************** */
#define EVENT_ID_GEN_RTC_CMP_0                            1 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                            2 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_OVF                              3 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PER_0                            4 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            5 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            6 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            7 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                            8 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                            9 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           10 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           11 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_EIC_EXTINT_0                        12 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        13 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        14 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        15 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        16 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        17 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        18 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        19 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        20 /* ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        21 /* ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       22 /* ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       23 /* ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       24 /* ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       25 /* ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       26 /* ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       27 /* ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_DMAC_CH_0                           30 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           31 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           32 /* ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           33 /* ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_TCC0_OVF                            34 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            35 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            36 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MCX_0                          37 /* ID for TCC0 event generator MCX_0 */
#define EVENT_ID_GEN_TCC0_MCX_1                          38 /* ID for TCC0 event generator MCX_1 */
#define EVENT_ID_GEN_TCC0_MCX_2                          39 /* ID for TCC0 event generator MCX_2 */
#define EVENT_ID_GEN_TCC0_MCX_3                          40 /* ID for TCC0 event generator MCX_3 */
#define EVENT_ID_GEN_TCC1_OVF                            41 /* ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            42 /* ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            43 /* ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MCX_0                          44 /* ID for TCC1 event generator MCX_0 */
#define EVENT_ID_GEN_TCC1_MCX_1                          45 /* ID for TCC1 event generator MCX_1 */
#define EVENT_ID_GEN_TCC2_OVF                            46 /* ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            47 /* ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            48 /* ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MCX_0                          49 /* ID for TCC2 event generator MCX_0 */
#define EVENT_ID_GEN_TCC2_MCX_1                          50 /* ID for TCC2 event generator MCX_1 */
#define EVENT_ID_GEN_TC3_OVF                             51 /* ID for TC3 event generator OVF */
#define EVENT_ID_GEN_TC3_MCX_0                           52 /* ID for TC3 event generator MCX_0 */
#define EVENT_ID_GEN_TC3_MCX_1                           53 /* ID for TC3 event generator MCX_1 */
#define EVENT_ID_GEN_TC4_OVF                             54 /* ID for TC4 event generator OVF */
#define EVENT_ID_GEN_TC4_MCX_0                           55 /* ID for TC4 event generator MCX_0 */
#define EVENT_ID_GEN_TC4_MCX_1                           56 /* ID for TC4 event generator MCX_1 */
#define EVENT_ID_GEN_TC5_OVF                             57 /* ID for TC5 event generator OVF */
#define EVENT_ID_GEN_TC5_MCX_0                           58 /* ID for TC5 event generator MCX_0 */
#define EVENT_ID_GEN_TC5_MCX_1                           59 /* ID for TC5 event generator MCX_1 */
#define EVENT_ID_GEN_ADC_RESRDY                          66 /* ID for ADC event generator RESRDY */
#define EVENT_ID_GEN_ADC_WINMON                          67 /* ID for ADC event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                           68 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           69 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                            70 /* ID for AC event generator WIN_0 */

/* ************************************************************************** */
/*  Event User IDs for SAMR21E16A */
/* ************************************************************************** */
#define EVENT_ID_USER_DMAC_CH_0                           0 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           1 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           2 /* ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                           3 /* ID for DMAC event user CH_3 */
#define EVENT_ID_USER_TCC0_EV_0                           4 /* ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                           5 /* ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                           6 /* ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                           7 /* ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                           8 /* ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                           9 /* ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_TCC1_EV_0                          10 /* ID for TCC1 event user EV_0 */
#define EVENT_ID_USER_TCC1_EV_1                          11 /* ID for TCC1 event user EV_1 */
#define EVENT_ID_USER_TCC1_MC_0                          12 /* ID for TCC1 event user MC_0 */
#define EVENT_ID_USER_TCC1_MC_1                          13 /* ID for TCC1 event user MC_1 */
#define EVENT_ID_USER_TCC2_EV_0                          14 /* ID for TCC2 event user EV_0 */
#define EVENT_ID_USER_TCC2_EV_1                          15 /* ID for TCC2 event user EV_1 */
#define EVENT_ID_USER_TCC2_MC_0                          16 /* ID for TCC2 event user MC_0 */
#define EVENT_ID_USER_TCC2_MC_1                          17 /* ID for TCC2 event user MC_1 */
#define EVENT_ID_USER_TC3_EVU                            18 /* ID for TC3 event user EVU */
#define EVENT_ID_USER_TC4_EVU                            19 /* ID for TC4 event user EVU */
#define EVENT_ID_USER_TC5_EVU                            20 /* ID for TC5 event user EVU */
#define EVENT_ID_USER_ADC_START                          23 /* ID for ADC event user START */
#define EVENT_ID_USER_ADC_SYNC                           24 /* ID for ADC event user SYNC */
#define EVENT_ID_USER_AC_SOC_0                           25 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           26 /* ID for AC event user SOC_1 */

#ifdef __cplusplus
}
#endif

#endif /* _SAMR21E16A_H_ */

